docs/elementaryOS/elementaryOS_hangul_input.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2021-04-12 Mon 22:23 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>elementary OS Setting up Hangul Input guide.</title>
<meta name="author" content="Taylor Shin" />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="https://fniessen.github.io/org-html-themes/src/readtheorg_theme/css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="https://fniessen.github.io/org-html-themes/src/readtheorg_theme/css/readtheorg.css"/>
</head>
<body>
<div id="content">
<h1 class="title">elementary OS Setting up Hangul Input guide.</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org016f354">1. Hangul Setup on elementary OS 5.</a>
<ul>
<li><a href="#orge77e8dc">1.1. Elementary OS Juno still uses Ubuntu 18.04 as its base which is already an ancient crap. Also, their repository has really limited software selections. But it looks SO GOOD!</a></li>
<li><a href="#org6066cc0">1.2. The Xorg engine itself cannot even run ibus correctly. And ibus is &rsquo;officially&rsquo; supported international language input method for elementary OS!! What a bummer! But we have some way to walkaround this problem with HarmoniKR linux&rsquo;s repo.</a></li>
</ul>
</li>
<li><a href="#org6a36662">2. Steps to enable Hangul input &rsquo;nimf&rsquo;</a></li>
</ul>
</div>
</div>

<div id="outline-container-org016f354" class="outline-2">
<h2 id="org016f354"><span class="section-number-2">1</span> Hangul Setup on elementary OS 5.</h2>
<div class="outline-text-2" id="text-1">
</div>
<div id="outline-container-orge77e8dc" class="outline-3">
<h3 id="orge77e8dc"><span class="section-number-3">1.1</span> Elementary OS Juno still uses Ubuntu 18.04 as its base which is already an ancient crap. Also, their repository has really limited software selections. But it looks SO GOOD!</h3>
</div>
<div id="outline-container-org6066cc0" class="outline-3">
<h3 id="org6066cc0"><span class="section-number-3">1.2</span> The Xorg engine itself cannot even run ibus correctly. And ibus is &rsquo;officially&rsquo; supported international language input method for elementary OS!! What a bummer! But we have some way to walkaround this problem with HarmoniKR linux&rsquo;s repo.</h3>
</div>
</div>

<div id="outline-container-org6a36662" class="outline-2">
<h2 id="org6a36662"><span class="section-number-2">2</span> Steps to enable Hangul input &rsquo;nimf&rsquo;</h2>
<div class="outline-text-2" id="text-2">
<ol class="org-ol">
<li><p>
We need to enable repo support first.
</p>
<div class="org-src-container">
<pre class="src src-sh">    <span style="color: #b58900; font-style: italic;">sudo</span> apt install software-properties-common
</pre>
</div>
<ul class="org-ul">
<li>This enables adding custom PPAs.</li>
</ul></li>

<li><p>
Now we need to add HarmoniKR&rsquo;s nimf repo.
</p>
<ul class="org-ul">
<li>For Juno&#x2026;</li>
</ul>
<div class="org-src-container">
<pre class="src src-sh">    <span style="color: #b58900; font-style: italic;">curl</span> -sL https://apt.hamonikr.org/setup_hamonikr.sun | <span style="color: #b58900; font-style: italic;">sudo</span> -E bash -
</pre>
</div>
<ul class="org-ul">
<li>For future releases which &rsquo;might&rsquo; be based on 20.04</li>
</ul>
<div class="org-src-container">
<pre class="src src-sh">    <span style="color: #96A7A9; font-style: italic;"># </span><span style="color: #96A7A9; font-style: italic;">curl</span><span style="color: #96A7A9; font-style: italic;"> -sL https://apt.hamonikr.org/setup_hamonikr.jin | </span><span style="color: #96A7A9; font-style: italic;">sudo</span><span style="color: #96A7A9; font-style: italic;"> -E bash -</span>
</pre>
</div></li>

<li><p>
As usual, install nimf and nimf-libhangul
</p>
<div class="org-src-container">
<pre class="src src-sh">    <span style="color: #b58900; font-style: italic;">sudo</span> apt update &amp;&amp; <span style="color: #b58900; font-style: italic;">sudo</span> apt install -y nimf nimf-libhangul
</pre>
</div>
<ul class="org-ul">
<li>A bit frustrating, nimf-libhangul needs nimf but it doesn&rsquo;t add nimf into install list automatically. Maybe their repo managment is not very good.</li>
</ul></li>

<li><p>
Then set up im-config manually.
</p>
<div class="org-src-container">
<pre class="src src-sh">    <span style="color: #b58900; font-style: italic;">sudo</span> im-config -n nimf
</pre>
</div></li>

<li>Restart the system or Xorg.</li>
</ol>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Taylor Shin</p>
<p class="date">Created: 2021-04-12 Mon 22:23</p>
</div>
</body>
</html>
